export const UpdateLog: string[][] = [
  ["2024/6/12 3.1.6版本", "* 修复发布评论bug"],
  [
    "2024/6/12 3.1.5版本",
    "* 修复标签图标错误显示问题",
    "* 修复不同屏幕尺寸显示bug",
    "* 吐槽新版选课猫欢迎加QQ群：344213052"
  ],
  ["2024/6/5 3.1.3版本", "* 选课猫新页面上线", "* 新增统计课程标签数量"],
  [
    "2023/11/28 2.0.22版本",
    "* 新增作者心里话",
    "* 新增项目团队的小广告",
    "* 喜报!取消了搜索限制"
  ],
  [
    "2023/11/25 2.0.21版本",
    "* 新增平台吐槽总数",
    "* 新增喵社区广告(帮帮孩子!)"
  ],
  [
    "2023/6/5 2.0.20版本",
    "* 修改了吐槽历史界面隐藏吐槽的展现方式",
    "* 新增了搜索限制和广告功能",
    "* 新增吐槽增加15次搜索",
    "* 新增广告增加5次搜索"
  ],
  ["2023/6/4 2.0.19版本", "* 新增评价时间降序显示"],
  ["2022/2/25 2.0.16版本", "* 修复字体bug"],
  ["2022/2/23 2.0.15版本", "* 暂时去除字体调整功能"],
  [
    "2022/2/16 2.0.14版本",
    "* 修改了教师主页的内容",
    "* 修改了读取吐槽标签的方式",
    "* 新增隐藏吐槽功能",
    "* 修复了热门搜索无法更新的问题",
    "* 修复了搜索框显示异常的问题",
    "* 新增字体调整功能"
  ],
  [
    "2022/2/15 2.0.13版本",
    "* 新修复了修改吐槽可能产生新吐槽的问题增吐槽历史",
    "* 更新了用户协议和免责声明"
  ],
  [
    "2022/2/14 2.0.12版本",
    "* 新增吐槽历史",
    "* 修改了教师主页吐槽卡片的布局",
    "* 新增教师主页我的吐槽高亮"
  ],
  [
    "2022/2/10 2.0.11版本",
    "* 显示每个评论的标签",
    "* 实现点赞功能",
    "* 实现可拖动吐槽按钮*读取页面数据"
  ],
  [
    "2022/2/8 2.0.10版本",
    "* 修改了免责声明",
    "* 新增用户协议和版本更新",
    "* 修改了搜索框的样式",
    "* 现在搜索框支持一键清空了"
  ],
  [
    "2022/2/7 2.0.9版本",
    "* 修改了搜索界面样式",
    "* 新增搜索结果界面的校区插图",
    "* 完成了吐槽界面",
    "* 新增教师界面相关课程跳转后高亮",
    "* 新增教师主页下拉刷新"
  ],
  [
    "2022/2/6 2.0.7版本",
    "* 修复导航栏图标和文字高度不统一的问题*修改数据更新逻辑",
    "* 修复由于页面跳转次数过多导致的无法打开新页面的问题"
  ],
  ["2022/2/5 2.0.6版本", "* 完善数据库，实现对用户吐槽的管理"],
  [
    "2022/1/29 2.0.5版本",
    "* 美化课程主页界面布局",
    "* 修改搜索结果界面到课程主页界面跳转的逻辑关系",
    "* 修改相关课程界面跳转的逻辑关系"
  ],
  ["2022/1/27 2.0.4版本", "* 顶部导航栏更新全新样式"],
  [
    "2022/1/26 2.0.3版本",
    "* 新增搜索界面，将所有搜索任务集中在此界面",
    "* 美化课程主页界面布局"
  ],
  ["2022/1/22 2.0.1版本", "* 基本构建项目雏形"],
  ["2022/1/18 2.0.0版本", "* 全新版本开始开发"],
  ["2021/3/12 1.0.4版本", "* 首个上线的版本", "* 再早的记不清了"]
];
